[
    {
        "date": "2020-10-12T00:00:00+05:30",
        "source": "Deccan News",
        "headline": "Microsoft, AICTE to Provide Skilled Students in Next Technologies",
        "url": "https://tinyurl.com/y62qr3zm",
        "content": "New Delhi: The All India Council for Technical Education (AICTE) announced on Monday that it has partnered with Microsoft to empower students and educators with future skills. As part of this partnership, more than 1,500 Microsoft course modules are made available to students and educators free of charge via the ELIS of AICTE’s e-learning portal. Microsoft’s learning resource center, Microsoft Learn, is integrated with the ELIS platform to provide access to personalized learning pathways and resources for students, which include a wide range of technologies, including AI, IoT, computer science, and cloud computing, among others."
    },
    {
        "date": "2020-03-25T00:00:00+05:30",
        "source": "",
        "headline": "Study from home using AICTE's NEAT platform",
        "url": "https://www.aicte-india.org/sites/default/files/Doc2.pdf",
        "content": ""
    },
    {
        "date": "2019-10-08T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Engineering students to work for the development of Agra villages",
        "url": "https://timesofindia.indiatimes.com/city/agra/engineering-students-to-work-for-the-development-of-villages/articleshowprint/71483237.cms",
        "content": "AGRA: To help all the nearby Agra villages to overcome their problems, students of engineering colleges will help them find solutions and also, work for their development. Each of the engineering college has been asked to adopt at least five villages for the overall development. Some of the engineering colleges have started a survey to identify the villages."
    },
    {
        "date": "2019-10-08T00:00:00+05:30",
        "source": "News18",
        "headline": "Allow Student Entrepreneurs With Short Attendance to Sit For Exams, AICTE Tells Engineering Colleges",
        "url": "https://www.news18.com/news/india/allow-student-entrepreneurs-with-short-attendance-to-sit-for-exams-aicte-tells-engineering-colleges-2337515.html",
        "content": "New Delhi: The All India Council of Technical Education (AICTE) has directed engineering colleges and technical institutions to allow student entrepreneurs to sit for examination even if their attendance is short. The colleges have also been asked to explore provisions of on-campus accommodation to student entrepreneurs and permitting semester break for working on their startups."
    },
    {
        "date": "2019-10-03T00:00:00+05:30",
        "source": "Times of India",
        "headline": "This tree plantation drive was a big hit",
        "url": "https://timesofindia.indiatimes.com/entertainment/events/nagpur/this-tree-plantation-drive-was-a-big-hit/articleshow/71422059.cms",
        "content": "The National Service Scheme (NSS) Unit of Gaikwad-Patil Group of Institutions organised a Tree Plantation and Swachhata Pakhwada recently at Mohagaon,Gumgaon, Shirur, Bothali,Dongargaon village in the presence of the officials of Gram Panchayat."
    },
    {
        "date": "2019-10-02T00:00:00+05:30",
        "source": "Times of India",
        "headline": "IIT Guwahati teams up with AICTE to train Kashmir students",
        "url": "https://timesofindia.indiatimes.com/city/guwahati/iit-guwahati-teams-up-with-aicte-to-train-kashmir-students/articleshowprint/71405664.cms",
        "content": "GUWAHATI: The Indian Institute of Technology, Guwahati (IIT-G) has signed a Memorandum of Understanding (MoU) with the All India Council for Technical Education (AICTE) to provide internships to students from Jammu and Kashmir. Through this collaboration, IIT-G will implement the Prime Minister's Special Scholarship Scheme for Jammu and Kashmir students which aims to provide better exposure to students from Jammu and Kashmir studying in higher learning institutes."
    },
    {
        "date": "2019-10-01T00:00:00+05:30",
        "source": "Times of India",
        "headline": "IIT Guwahati implements Prime Minister’s Scholarship Scheme for J&K students",
        "url": "https://timesofindia.indiatimes.com/home/education/news/iit-guwahati-implements-prime-ministers-scholarship-scheme-for-jk-students/articleshowprint/71395631.cms",
        "content": "GUWAHATI: Indian Institute of Technology, Guwahati (IITG), along with the All India Council for Technical Education (AICTE) has implemented the Prime Minister’s Special Scholarship Scheme for Jammu and Kashmir students. A Memorandum of Understanding (MoU) has been signed to this effect to pave the way for providing exposure to the youth from Jammu and Kashmir to advanced academic culture at the higher learning institutes of the country."
    },
    {
        "date": "2019-09-30T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Sanskrit can be taught based on interest: AICTE chairman",
        "url": "https://timesofindia.indiatimes.com/city/chennai/sanskrit-can-be-taught-based-on-interest-aicte-chairman/articleshowprint/71367560.cms",
        "content": "CHENNAI: AICTE chairman Anil D Sahasrabudhe played down the controversy surrounding introduction of Sanskrit in technical institutions.A controversy erupted after a department from Anna University made Philosophy compulsory, which included chapters from Bhagvad Gita and Upanishad, for BTech students. Political parties cried foul saying it amounts to imposing Sanskrit language. The University clarified that it would bring amendment to make it a choice for students."
    },
    {
        "date": "2019-09-15T00:00:00+05:30",
        "source": "Times of India",
        "headline": "M Tech won’t suffice to teach engineering; certificate course may be needed soon",
        "url": "https://timesofindia.indiatimes.com/city/chennai/m-tech-wont-suffice-to-teach-engg-certificate-course-may-be-needed-soon/articleshowprint/71131238.cms",
        "content": "CHENNAI: In a move to improve the coaching provided to engineering students in the country, All India Council for Technical Education (AICTE) is planning to make a certificate course and industrial training mandatory for ME or M Tech graduates who choose to become a faculty member and teach aspirants."
    },
    {
        "date": "2019-09-04T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE will inspect government-run colleges in Gujarat",
        "url": "https://timesofindia.indiatimes.com/city/ahmedabad/aicte-will-inspect-govt-run-colleges-in-state/articleshowprint/70967956.cms",
        "content": "AHMEDABAD: The All India Council for Technical Education (AICTE) will inspect Gujarat government run colleges on several aspects, including quality of teaching, infrastructure issues and placement."
    },
    {
        "date": "2019-08-24T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Engineering colleges need to reinvent to be relevant",
        "url": "https://timesofindia.indiatimes.com/home/education/news/engineering-colleges-need-to-reinvent-to-be-relevant/articleshowprint/70839936.cms",
        "content": "This year, of 1,67,652 engineering seats available in Tamil Nadu, only 83,396 (49.74 % ) were filled. In Maharashtra, 50% engineering seats have been reported to be vacant in this academic year (2019-20). Several other states including Gujarat, Telangana, Chattisgarh and Odisha have similar stories to tell."
    },
    {
        "date": "2019-08-02T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Offer courses in emerging technology: AICTE to engineering colleges",
        "url": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/offer-courses-in-emerging-tech-aicte-to-engg-colleges/articleshowprint/70488770.cms",
        "content": "THIRUVANANTHAPURAM: All India Council for Technical Education (AICTE) has directed all affiliating universities in the country to ensure that engineering colleges affiliated under them start offering multi-disciplinary courses with special focus on emerging technologies."
    },
    {
        "date": "2019-08-01T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE to launch online portal to collect students' feedback",
        "url": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/aicte-to-launch-online-portal-to-collect-students-feedback/articleshowprint/70478207.cms",
        "content": "THIRUVANANTHAPURAM: In a bid to improve quality of engineering education in institutions across the country, All India Council for Technical Education (AICTE) is planning to introduce a slew of new programmes and guidelines, including a 24 x7 online mechanism for collecting students' feedback on teaching faculties in technical institutions."
    },
    {
        "date": "2019-07-27T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Unfilled seats: AICTE won’t accredit new colleges for 2 years",
        "url": "https://timesofindia.indiatimes.com/city/chennai/unfilled-seats-aicte-wont-accredit-new-colleges-for-2yrs/articleshowprint/70425267.cms",
        "content": "CHENNAI: Engineering admission has dropped to 50%-55% in the last four years and due to the huge vacancies in colleges, the All India Council for Technical Education will not accredit new engineering and pharma colleges for the next two years, AICTE chairman Anil D Sahasrabudhe said on Sunday."
    },
    {
        "date": "2019-07-15T00:00:00+05:30",
        "source": "Times of India",
        "headline": "BDU to seek AICTE nod for course under BSM",
        "url": "https://timesofindia.indiatimes.com/city/trichy/bdu-to-seek-aicte-nod-for-course-under-bsm/articleshowprint/70220139.cms",
        "content": "TRICHY: Bharathidasan university is planning to approach All India Council for Technical Education (AICTE) for approval to its MBA programmes offered under Bharathidasan school of management (BSM). It is mandatory for institutions to get approval from the AICTE for its technical programmes. BSM was started in 2016 during the period of then vice chancellor VM Muthu Kumar and being run after getting approval from UGC."
    },
    {
        "date": "2019-07-15T00:00:00+05:30",
        "source": "",
        "headline": "AICTE mandates career skilling course for technical colleges to upgrade social, communication skills of students",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-mandates-career-skilling-course-for-technical-colleges-to-upgrade-social-communication-skills-of-students/articleshowprint/70225941.cms",
        "content": "The 20-hour course available free of cost will teach soft skills, corporate etiquette, CV writing to students Engineering students from more than 10,000 technical colleges under the umbrella of AICTE will now have to undergo a training course to upgrade their social and communication skills in order to increase employability. AICTE recently partnered with TCS iON to offer an online course to acquire basic professional skills."
    },
    {
        "date": "2019-07-15T00:00:00+05:30",
        "source": "",
        "headline": "AICTE not to allow low employment potential disciplines from 2020-21",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-not-to-allow-low-employment-potential-disciplines-from-2020-21/articleshowprint/70227017.cms",
        "content": "NEW DELHI: The All India Council for Technical Education (AICTE) will not allow new conventional disciplines with low employment potential from the academic year 2020-21 and will permit only emerging fields like Artificial Intelligence and Block chain, Lok Sabha was informed on Monday."
    },
    {
        "date": "2019-07-10T00:00:00+05:30",
        "source": "Times of India",
        "headline": "TCS iON partners AICTE to equip students with career skills",
        "url": "https://timesofindia.indiatimes.com/business/india-business/tcs-ion-partners-aicte-to-equip-students-with-career-skills/articleshowprint/70159553.cms",
        "content": "TCS iON, a unit of IT major Tata Consultancy Services, Wednesday said it has partnered with All India Council for Technical Education (AICTE) to provide students with a digital learning course to equip them with career skills.TCS iON has curated a free, 20 hour-career skills course that will cover topics like corporate etiquette, effective e-mail writing, impactful presentations and IT awareness that will be available to students throughout the duration of their degree course."
    },
    {
        "date": "2019-07-09T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Engineering seats has come down from 16.5lakh to 14 lakh in three years, AICTE chairman says",
        "url": "https://timesofindia.indiatimes.com/city/coimbatore/engineering-seats-has-come-down-from-16-5lakh-to-14-lakh-in-three-years-aicte-chairman-says/articleshowprint/70146301.cms",
        "content": "COIMBATORE: The total number of engineering seats in technical institutions across the country, which was around 16.5lakh in 2015-2016, came down to 14lakh seats this year, said Anil Sahasrabudhe, chairman of the All India Council for Technical Education (AICTE).On an average 80,000 seats have been closed each year for the past three years, he said. This was because around 80 engineering colleges have been closed across the country and around 200 engineering colleges had very less admissions."
    },
    {
        "date": "2019-07-01T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Rajasthan sets benchmark in technical education",
        "url": "https://timesofindia.indiatimes.com/city/jaipur/state-sets-benchmark-in-technical-education/articleshowprint/70016228.cms",
        "content": "JAIPUR: The state has bagged 84 projects out of 413 under the collaborative research and innovative scheme which is highest in the country. The scheme is funded by All India Council for Technical Education (AICTE). The scheme is meant to encourage the junior faculties of technical colleges and universities to carry out research projects in mentorship with institutes like IITs, NITs and others."
    },
    {
        "date": "2019-06-10T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Career guidance: All you need to know about having a career in Pharmacy",
        "url": "https://timesofindia.indiatimes.com/home/education/news/career-guidance-all-you-need-to-know-about-having-a-career-in-pharmacy/articleshowprint/69728072.cms",
        "content": "For academic session 2019-20, All India Council for Technical Education (AICTE) has approved as many as 57,747 pharmacy seats in 842 new colleges across India. With the new additions, there will now be a total of 2, 62,698 diploma, undergraduate and postgraduate seats in 3,726 pharmacy institutes this year. The surge in number of seats underlines the ever expanding Indian pharmaceutical market. This is one of the few sectors which are growing in double digit Compounded Annual Growth Rate (CAGR), say experts."
    },
    {
        "date": "2019-05-28T00:00:00+05:30",
        "source": "NDTV",
        "headline": "Maths in Class XII a must for biotech courses",
        "url": "https://timesofindia.indiatimes.com/city/chennai/maths-in-class-xii-a-must-for-biotech-courses/articleshowprint/69528645.cms",
        "content": "CHENNAI: The validity of B Tech degrees in biotechnology earned by several thousand graduates all these years is in doubt, as the All India Council for Technical Education (AICTE) says admission of students who didn’t take mathematics in Class XII is invalid under the present rules."
    },
    {
        "date": "2019-05-27T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Empowering differently-abled through professional courses",
        "url": "https://timesofindia.indiatimes.com/home/education/news/empowering-differently-abled-through-professional-courses/articleshowprint/69524617.cms",
        "content": "A government-aided polytechnic affiliated to the Board of Technical Examinations, Government of Karnataka and approved by the All India Council for Technical Education (AICTE), New Delhi has been attracting these students, mostly from nearby rural areas by offering well-qualified and committed faculty members to provide quality technical education to the differently-abled with the state-of-the-art facilities in the campus."
    },
    {
        "date": "2019-05-24T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE approves additional 57 k pharma seats in 448 new colleges",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-approves-additional-57-k-pharma-seats-in-448-new-colleges/articleshowprint/69484500.cms",
        "content": "BENGALURU: A whopping 57,747 more pharmacy course seats and 842 new institutions, after the All India Council for Technical Education (AICTE) approved the same.In all, the AICTE has approved an intake of 2,62,698 diploma, UG and PG seats in 3726 pharma institutions this year."
    },
    {
        "date": "2019-05-14T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE approval for Pune's FTII courses",
        "url": "https://timesofindia.indiatimes.com/city/pune/aicte-approval-for-ftii-courses/articleshowprint/69314796.cms",
        "content": "PUNE: The All India Council for Technical Education (AICTE) has granted approval to the five courses offered by the Film and Television Institute of India (FTII) Pune under its newly-created applied arts and crafts category."
    },
    {
        "date": "2019-05-04T00:00:00+05:30",
        "source": "Times of India",
        "headline": "After IIT-H, Nagpur's Raisoni College starts B.Tech in AI",
        "url": "https://timesofindia.indiatimes.com/home/education/news/after-iit-h-nagpurs-raisoni-college-starts-b-tech-in-ai/articleshowprint/69329219.cms",
        "content": "NAGPUR: The All India Council for Technical Education (AICTE) has okayed city-based GH Raisoni College of Engineering's proposal to start Bachelor of Technology in Artificial Intelligence from the academic year 2019-20."
    },
    {
        "date": "2019-04-30T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE and Taiwan join hands to push academic collaboration between two countries",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-and-taiwan-join-hands-to-push-academic-collaboration-between-the-two-countries/articleshowprint/69114396.cmshttps://timesofindia.indiatimes.com/home/education/news/aicte-and-taiwan-join-hands-to-push-academic-collaboration-between-the-two-countries/articleshowprint/69114396.cms",
        "content": "All India Council for Technical Education (AICTE) and Taiwan join hands to push academic collaboration between the two countries. The collaboration initiated by the Taipei Economic and Cultural Center in India (TECC) - Education division, will focus on offering international opportunities to Indian students and improving the industry and academic cooperation between India and Taiwan. AICTE plans to facilitate the association between Indian and Taiwan universities, however, the MoUs will be signed as per their requirements."
    },
    {
        "date": "2019-04-30T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE to approve new institutes only if they offer emerging tech courses",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-to-approve-new-institutes-only-if-they-offer-emerging-tech-courses/articleshowprint/69114911.cms",
        "content": "From the academic session 2020-2021, AICTE will give approval to start new technical institutes only in nine emerging technologies including artificial intelligence (AI), Internet of Things (IoT), blockchain, robotics, quantum computing, data sciences, cybersecurity, 3D printing and design, AR/VR ."
    },
    {
        "date": "2019-04-22T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Retired IIT, NIT professors to mentor AICTE colleges",
        "url": "https://timesofindia.indiatimes.com/home/education/news/retired-iit-nit-professors-to-mentor-aicte-colleges/articleshowprint/68990176.cms",
        "content": "After trying different ways to improve the quality of technical education, the All India Council for Technical Education (AICTE) is now inviting retired and serving professors from IITs, NITs to mentor the faculty of various institutes that do not have accreditation from National Board of Accreditation (NBA). This decision has been taken to prevent the shutting down of institutes that may not get accredited by NBA."
    },
    {
        "date": "2019-03-25T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE to introduce students feedback-based assessment for the promotion of Engineering teachers",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-to-introduce-students-feedback-based-assessment-for-the-promotion-of-engineering-teachers/articleshowprint/68557997.cms",
        "content": "All India Council of Technical Education's (AICTE) decision to include the students' feedback to assess the teachers has been introduced to improve the educational quality of engineering colleges. But, its effectiveness remains to be seen. \"Since students' feedback will be considered while granting promotion to the teachers, they will have to put their best foot forward in the classroom. This assessment pattern is followed by the IITs and NITs,\" says AICTE chairman Anil Sahasrabudhe."
    },
    {
        "date": "2019-03-18T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Alumni network must be engaged with for growth of students, says AICTE chief",
        "url": "https://timesofindia.indiatimes.com/city/mysuru/alumni-network-must-be-engaged-with-for-growth-of-students-says-aicte-chief/articleshowprint/68455345.cms",
        "content": "Mysuru: Emphasising the need to use the network of alumni spread across the globe, and the need to engage with industry on a constant basis and encourage research, All India Council for Technical Education (AICTE) chairman Anil D Sahasrabhudhe on Sunday said that these were essential for the academic growth of students."
    },
    {
        "date": "2019-03-11T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Technical institutes to be ranked based on startups created annually",
        "url": "https://timesofindia.indiatimes.com/home/education/news/technical-institutes-to-be-ranked-based-on-startups-created-annually/articleshowprint/68363795.cms",
        "content": "AICTE issues new rules for assessment of standard to maintain education and research quality in technical institutesAll India Council for Technical Education (AICTE) has announced some major amendments in the existing rules for technical education in India. This is likely to rectify the curriculum, faculty roles and research programmes in technical institutes across the country."
    },
    {
        "date": "2019-02-23T00:00:00+05:30",
        "source": "Times of India",
        "headline": "MIT, Manipal to host Smart India Hackathon 2019",
        "url": "https://timesofindia.indiatimes.com/home/education/news/mit-manipal-to-host-smart-india-hackathon-2019/articleshowprint/68127292.cms",
        "content": "NEW DELHI: The Manipal Institute of Technology, MAHE will be one of the 48 nodal centres for the finale of Smart India Hackathon (SIH) being organized by the Government of India across the country simultaneously on March 2 and 3, 2019. The hackathon aims to promote digital drive and encourage digital nous to make growth a mass programme and put governance within everyone’s reach through innovation and entrepreneurship."
    },
    {
        "date": "2019-02-22T00:00:00+05:30",
        "source": "Times of India",
        "headline": "UGC, AICTE issue advisory for safety if Kashmiri students",
        "url": "https://timesofindia.indiatimes.com/home/education/news/ugc-aicte-issue-advisory-for-safety-if-kashmiri-students/articleshowprint/68118065.cms",
        "content": "The University Grants Commission (UGC), the All-India Council of Technical Education (AICTE) and other central academic bodies, on Friday, issued an advisory to vice-chancellors and principals across the country to ensure safety and protection of Kashmiri students on their campuses"
    },
    {
        "date": "2019-02-05T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Degree and professional courses curriculum to be more flexible",
        "url": "https://timesofindia.indiatimes.com/city/hyderabad/degree-and-professional-courses-curriculum-to-be-more-flexible/articleshow/67841729.cms",
        "content": "HYDERABAD: Starting from the forthcoming academic year, the Telangana collegiate and technical education department is set to introduce a list of subjects and combinations to make the curriculum more versatile. This is in addition to the mandatory massive online open courses (MOOCs). With the introduction of these reforms, degree and professional college students will have the flexibility to learn from a range of topics such as soft-skills and liberal arts among others."
    },
    {
        "date": "2019-02-03T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Finale of Smart India Hackathon begins in Coimbatore",
        "url": "https://timesofindia.indiatimes.com/city/coimbatore/finale-of-smart-india-hackathon-begins-in-coimbatore/articleshowprint/68234922.cms",
        "content": "COIMBATORE: A total of 55 student teams, comprising more than 400 students from colleges across the country have converged at two city colleges to participate in the finale of the third edition of Smart India Hackathon 2019, a 36-hour continuous coding competition conducted by the ministry of human resource development and All India Council for Technical Education (AICTE). The hackathon is being held in 48 nodal centres across the country of which six are in the state."
    },
    {
        "date": "2019-01-31T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE to cut 40,000 seats in government engineering colleges across India",
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/aicte-to-cut-40000-seats-in-govt-engg-colleges-across-india/articleshowprint/67763635.cms",
        "content": "BENGALURU: With state-run engineering colleges not ramping up infrastructure and fixing the staff shortage problem, the All India Council for Technical Education (AICTE) has decided to reduce 40,000 seats in government colleges across the country. Every year, about 10 lakhs engineering seats are available across India."
    },
    {
        "date": "2019-01-29T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE reduces lateral intake for diploma students to 10%",
        "url": "https://timesofindia.indiatimes.com/city/aurangabad/aicte-reduces-lateral-intake-for-diploma-students-to-10/articleshowprint/67744742.cms",
        "content": "AURANGABAD: The All India Council for Technical Education (AICTE) has brought down the intake of direct admission to second-year engineering courses for diploma holders from 20 to 10% of the approved seats from the upcoming academic year (2019-20)."
    },
    {
        "date": "2019-01-29T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE chief moots industry-institute interaction",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-chief-moots-industry-institute-interaction/articleshowprint/67734311.cms",
        "content": "KOLKATA: All India Council for Technical Education (AICTE) Chairman Anil D Sahasrabudhe has underscored the importance of industry-institute interaction.Sahasrabudhe, who was addressing a workshop at a private engineering institute here Sunday, said the council encouraged more industry-institute interaction and innovation in entrepreneurship."
    },
    {
        "date": "2019-01-20T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE plan evokes mixed response from academia",
        "url": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/aicte-plan-evokes-mixed-response-from-academia/articleshowprint/67616046.cms",
        "content": "Thiruvananthapuram: The AICTE's latest proposition that engineering colleges swelling with vacant seats may start arts and science courses to overcome the crisis is unlikely to work out in favour of a majority of engineering colleges in the brink of closure in Kerala.Latest statistics show that 50% of seats in self-financing engineering colleges in the state remains vacant after the completion of admission procedure. While the state government is yet to make up its mind on the policy decisions to be taken to restore order and quality in engineering education sector, engineering college managements too have not yet been able to develop a long-term strategy for quality assurance and survival."
    },
    {
        "date": "2019-01-19T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE refuses approval to new engineering colleges, review report after every 2 academic sessions",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-refuses-approval-to-new-engineering-colleges-review-report-after-every-2-academic-sessions/articleshowprint/67597077.cms",
        "content": "NEW DELHI: The All Indian Council for Technical Education(AICTE) has given a verdict regarding the existing institutions and the upcoming ones. As per AICTE there won’t be any new engineering colleges from the academic session 2020-2021. AICTE has even declared that it would review the new creation capacity after every two academic years."
    },
    {
        "date": "2019-01-17T00:00:00+05:30",
        "source": "Indian Express",
        "headline": "Don’t allow new colleges from 2020, review every two years: Panel to engg body",
        "url": "https://indianexpress.com/article/education/aicte-government-committee-anil-sahasrabuddhe-5517865/",
        "content": "With more than half the engineering seats falling vacant every year, a government committee, headed by IIT-Hyderabad chairman B V R Mohan Reddy, has advised the All India Council for Technical Education (AICTE) to stop setting up new colleges from 2020 and review the creation of new capacity every two years after that."
    },
    {
        "date": "2019-01-17T00:00:00+05:30",
        "source": "Indian Express",
        "headline": "AICTE suggests Indian authors books for engineering students, UGC promotes",
        "url": "https://indianexpress.com/article/education/aicte-suggests-indian-authors-books-for-engineering-students-ugc-promotes/",
        "content": "Books by Indian authors and publishers will contextualise the engineering course content for students for better understanding, said UGC circular. Students, however, prefer foreign authors stating better content quality. Academicians ask for more technical books by Indian writers and focused incentivized initiatives from the government."
    },
    {
        "date": "2019-01-16T00:00:00+05:30",
        "source": "NDTV",
        "headline": "25 Per Cent Hike In College Seats To Enable Quota For Economically Weak",
        "url": "https://www.ndtv.com/india-news/25-hike-in-college-varsity-seats-to-allow-centres-weaker-section-quota-1978175",
        "content": "Union Minister for Human Resource Development Prakash Javadekar has announced a 25 per cent increase in seats across educational institutions to ensure that the 10 per cent reservation recently given to the Economically Backward Section (EWS) does not disturb existing quotas for the sheduled castes, scheduled tribes and other backward classes. The changes will be carried out from the 2019-2020 academic session, he told reporters at a press meet held in the national capital today."
    },
    {
        "date": "2019-01-15T00:00:00+05:30",
        "source": "NDTV",
        "headline": "MHRD To Implement 10% Quota Law. College Seats Set To Increase",
        "url": "https://www.ndtv.com/education/10-quota-in-schools-colleges-universities-from-2019-mhrd-1978176",
        "content": "NEW DELHI: The quota for the economically weak, which allows them 10% reservation benefit, will be implemented in all educational institutions from 2019. \"10% EWS quota will be implemented in the AY 2019-20 itself, without impacting the existing quotas for SCs,STs & OBCs and general seats,\" said Union HRD Minister Prakash Javadekar today in a meeting with the UGC and the AICTE. \"Adequate additional seats will be created in these colleges and universities to implement the quota for EWS. The UGC and AICTE will be provided the operational mandate within a week to implement the quota,\" he added. "
    },
    {
        "date": "2019-01-10T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Poor faculty strength may shrink UVCE intake by 10%",
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/poor-faculty-strength-may-shrink-uvce-intake-by-10/articleshowprint/67461189.cms",
        "content": "Bengaluru: One of the oldest engineering institutions in the country, University Visvesvaraya College of Engineering (UVCE), is facing the prospect of its intake being cut by 10% every year, beginning 2019-20.Taking a serious note of the staff shortage in the institution, All India Council for Technical Education (AICTE) is planning to reduce UVCE’s intake by 10% in the next academic year."
    },
    {
        "date": "2019-01-09T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE announces approval process for colleges, universities",
        "url": "https://timesofindia.indiatimes.com/city/chandigarh/aicte-announces-approval-process-for-colleges-universities/articleshowprint/67445722.cms",
        "content": "All-India Council for Technical Education (AICTE), ministry of human resource development (MHRD), New Delhi, has announced the approval process handbook for extension of approvals for 10,495 existing technical institutions/deemed universities in the country and for new upcoming institutions for the academic session 2019-20.Submission of online applications for the session 2019-20 in respect of all approvals shall begin on January 14 and end on February 3. The last date for submission of online application with penalty (as per the provisions of APH 2019-20) for extension of approval based on self-disclosure for existing institutions is permitted up to February 8."
    },
    {
        "date": "2019-01-09T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE nod to arts & science courses in engineering colleges",
        "url": "https://timesofindia.indiatimes.com/city/hyderabad/aicte-nod-to-arts-science-courses-in-engineering-colleges/articleshowprint/67454825.cms",
        "content": "HYDERABAD: Engineering colleges will be able to offer degree and diploma courses in arts and science from academic year 2019-20 as the All India Council of Technical Education (AICTE) has permitted them to use excess infra and unused resources for other job-oriented and emerging technology courses."
    },
    {
        "date": "2019-01-09T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE extends affiliation of 408 techincal institutions",
        "url": "https://timesofindia.indiatimes.com/city/chandigarh/aicte-extends-affiliation-of-408-techincal-institutions/articleshowprint/67445770.cms",
        "content": "Chandigarh: The All India Council for Technical Education (AICTE) has extended the affiliation of 393 techincal institutions in Punjab and 15 in Chandigarh for the 2019-20 academic session. All institutes have been asked to submit the fee by February 3, failing which the council will disaffiliate the institution concerned. On a demand by the institutions, the council has already relaxed existing affiliation norms."
    },
    {
        "date": "2019-01-04T00:00:00+05:30",
        "source": "Indian Express",
        "headline": "AICTE decides to allow arts and science courses in engineering colleges",
        "url": "http://www.newindianexpress.com/states/tamil-nadu/2019/jan/04/aicte-decides-to-allow-arts-and-science-courses-in-engineering-colleges-1920436.html",
        "content": "Confirming the decision, AICTE chairman Anil D Sahasrabudhe told Express, \"If other programmes are to be run, the requirement of each programme should be available separately except playground, parking, canteen, etc.\"  In Tamil Nadu, engineering colleges come under the control of Anna University, whereas arts and science colleges are covered by arts and science universities like University of Madras, Bharathiar University, Madurai Kamaraj University, etc."
    },
    {
        "date": "2018-11-28T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Reforms in tech institutes by 2019: AICTE chairman",
        "url": "https://timesofindia.indiatimes.com/city/chandigarh/reforms-in-tech-institutes-by-2019-aicte-chairman/articleshow/66837619.cms",
        "content": "CHANDIGARH: All India Council of Technical Education (AICTE) chairman Anil Sahasrabudhe on Tuesday said that the reforms, including the open book examination, mandatory internships and training programmes, for faculty members across all technical institutions in the country would be implemented from 2019. However, he said that it would take around three years for this. He was speaking on the sidelines of platinum jubilee celebrations of the University Institute of Pharmaceutical Sciences (UIPS) here on Tuesday. "
    },
    {
        "date": "2018-11-25T00:00:00+05:30",
        "source": "",
        "headline": "AICTE chief: Higher education teachers must be trained properly",
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/aicte-chief-higher-education-teachers-must-be-trained-properly/articleshow/66792126.cms",
        "content": "ENGALURU: Emphasis should be put on training teachers working in the country’s higher education sector for proper implementation of education policies, said Anil Dattatraya Sahasrabudhe, chairman of All India Council of Technical Education (AICTE), on Saturday."
    },
    {
        "date": "2018-10-29T00:00:00+05:30",
        "source": "NDTV",
        "headline": "CMAT, GPAT Registration This Week",
        "url": "https://www.ndtv.com/education/cmat-gpat-registration-on-november-1-1939438",
        "content": "Admit cards for both the exams will be released on January 7, 2019 and results will be announced on February 10, 2019."
    },
    {
        "date": "2018-10-24T00:00:00+05:30",
        "source": "NDTV",
        "headline": "SWAYAM Examination In December; Register For Exam Till This Date",
        "url": "https://www.ndtv.com/education/swayam-examination-2018-in-december-1936784",
        "content": "MHRD will conduct SWAYAM examination 2018 in December."
    },
    {
        "date": "2018-10-23T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Don't downsize teaching staff, technical colleges told",
        "url": "https://timesofindia.indiatimes.com/city/hyderabad/dont-downsize-teaching-staff-technical-colleges-told/articleshow/65098889.cms",
        "content": "The All India Council for Technical Education's (AICTE) direction to all technical colleges across the nation to not downsize teachers citing new student-teacher ratio has not gone down well with college managements in the state as they said that this will increase the financial burden on them. "
    },
    {
        "date": "2018-10-12T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Mergers alone cannot help ailing technical colleges: Sahasrabudhe",
        "url": "https://timesofindia.indiatimes.com/home/education/news/mergers-alone-cannot-help-ailing-technical-colleges-sahasrabudhe/articleshow/66180857.cms",
        "content": "“Institutes located in the interiors with as many as 300-400 seats, started with an aim to cater to the educational needs of students in remote locations are on the verge of closing down, despite their best efforts. These colleges do not attract enough enrolment as students opt for institutes that offer better facilities and exposure.”"
    },
    {
        "date": "2018-10-02T00:00:00+05:30",
        "source": "Carleton Newsroom",
        "headline": "Boot Camp for Women-Led Startups",
        "url": "https://newsroom.carleton.ca/story/women-led-startups-bootcamp/",
        "content": "The Canada-India Accelerator Program is making sure Canada’s startups will be part of its growth. Delivered through Carleton University’s Canada-India Centre of Excellence, the program will send 10 women-led startups from across Canada to India for up to three months in early 2019. But first, it welcomed 10 female Indian entrepreneurs for a two-week Transnational Boot Camp."
    },
    {
        "date": "2018-10-01T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE setting up 4 teacher training academies",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-setting-up-4-teacher-training-academies/articleshowprint/66023204.cms",
        "content": "The AICTE is setting up four teacher training academies in the country which will equip candidates with the latest changes in technical education, the council's Chairman Anil Dattatraya Sahasrabudhe said Sunday."
    },
    {
        "date": "2018-09-04T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Teachers Day: AICTE to train teachers to make them tech-savvy",
        "url": "https://timesofindia.indiatimes.com/home/education/news/aicte-to-train-teachers-to-make-them-tech-savvy/articleshow/65664714.cms",
        "content": "The All India Council for Technical Education (AICTE) will start a training programme for the teachers to make them tech-savvy and understand the concept of blend learning. Blend learning is an education programme (formal or non-formal) that combines online digital media with traditional classroom methods"
    },
    {
        "date": "2018-09-03T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE asks colleges to set up clubs for innovative ideas",
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/aicte-asks-colleges-to-set-up-clubs-for-innovative-ideas/articleshow/65652398.cms",
        "content": "The All India Council of Technical Education (AICTE) has asked all its affiliate institutions to set up innovation clubs to foster ‘out-of-the-box’ thinking in a bid to boost the Centre’s Make in India initiative."
    },
    {
        "date": "2018-08-30T00:00:00+05:30",
        "source": "NDTV",
        "headline": "HRD Ministry Introduces Atal Ranking For Institutions To Promote Innovation",
        "url": "https://www.ndtv.com/education/hrd-ministry-introduces-atal-ranking-for-institutions-to-promote-innovation-1908732",
        "content": "To promote a culture of innovation and research in higher education, the Union government has introduced Atal Ranking of Institutions on Innovation Achievements (ARRIA), Union HRD Minister Prakash Javadekar announcement today. "
    },
    {
        "date": "2018-08-07T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Train teachers as per new curriculum, AICTE tells colleges",
        "url": "https://timesofindia.indiatimes.com/city/noida/train-teachers-as-per-new-curriculum-aicte-tells-colleges/articleshow/65299300.cms",
        "content": "The All India Council for Technical Education has sent a proposal to all technical colleges and institutes to provide mandatory training for teachers as per the council’s new curriculum. Vice-chairman of AICTE, Dr M P Poonia, said only those who clear this training should be kept and rest should be let go."
    },
    {
        "date": "2018-07-15T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE wants engineering graduates to become entrepreneurs",
        "url": "https://timesofindia.indiatimes.com/home/education/news/acite-wants-engineering-graduates-to-become-entrepreneurs/articleshow/64990150.cms",
        "content": "The All India Council for Technical Education (AICTE) has been focusing on making students set up their own businesses rather than be job seekers, said AICTE advisor Dileep Malkhede on Saturday. “We have been promoting activities such as incubation centre and to promote entrepreneurship we have several initiatives such as giving funds for SC/ST students to start their own businesses,” he said. AICTE has also started having courses on entrepreneurship which has been adopted by universities. He was responding to a question on the nature of current job market where graduates find it difficult to get jobs."
    },
    {
        "date": "2017-07-30T00:00:00+05:30",
        "source": "Times of India",
        "headline": "AICTE to cut down on theory, focus more on practice",
        "url": "http://timesofindia.indiatimes.com/city/chennai/aicte-to-cut-down-on-theory-focus-more-on-practice/articleshow/59826390.cms",
        "content": "Students of the upcoming academic year across engineering and technical institutions will be the first batch to be introduced to the model curriculum of the All India Council for Technical Education (AICTE)."
    },
    {
        "date": "2017-06-25T00:00:00+05:30",
        "source": "Times of India",
        "headline": "Internships to be made must for engineering: AICTE chairman",
        "url": "http://timesofindia.indiatimes.com/home/education/news/internships-to-be-made-must-for-engineering-aicte-chairman/articleshow/59764407.cms",
        "content": "From addressing underemployment among engineering graduates to handing them degrees only on completion of four months of internship, some overarching changes are in the pipeline in technical education in India."
    },
    {
        "date": "2017-06-19T00:00:00+05:30",
        "source": "First Post",
        "headline": "National Eligibility Test likely to be introduced in 2019-20 mic year: AICTE chairman",
        "url": "http://www.firstpost.com/india/national-eligibility-test-likely-to-be-introduced-in-2019-20-academic-year-aicte-chairman-3714093.html",
        "content": "With some states opposing introduction of National Eligibility Test (NET) for admission to engineering courses, it is unlikely to be held next year but could become a reality in 2019-'20, a top AICTE official said on Monday."
    },
    {
        "date": "2017-04-10T00:00:00+05:30",
        "source": "Zee News",
        "headline": "Students’ understanding of concepts and skill will be tested now - AICTE to release model exam format",
        "url": "http://zeenews.india.com/education/students-understanding-of-concepts-and-skill-will-be-tested-now-aicte-to-release-model-exam-format-1994663.html",
        "content": "The All India Council for Technical Education (AICTE) is all set to release the provision of a model exam format to technical education institutes for testing the conceptual knowledge of children."
    },
    {
        "date": "2017-04-09T00:00:00+05:30",
        "source": "Zee News",
        "headline": "Engineering colleges not maintaining prescribed student-faculty ratio will face action: AICTE",
        "url": "http://zeenews.india.com/education/engineering-colleges-not-maintaining-prescribed-student-faculty-ratio-will-face-action-aicte-1994289.html",
        "content": "Engineering colleges not maintaining the prescribed student-faculty ratio will be liable for action, the All India Council for Technical Education (AICTE) has said."
    }
]